"""
常用运算符：
          +（加）   -（减）
          *（乘）、/（除）
          %（取余） //（整除） **（幂运算符，或叫乘方运算符）

python 也有 +（加）、-（减）、*（乘）、/（除）、%（取余）这 5个运算符，除此之外还有两个特殊的运算符，分别是 //（整除）和 **（幂运算符，或叫乘方运算符）。
"""
#优先级问题
#   先算乘除再算加减

"""
比较操作符
    < 小于  <=小于等于    
    > 大于  >=大于等于    
    ==等于  !=不等于
比较操作符根据表达式的值的真假返回布尔类
"""

"""
逻辑操作符
    and or not
        and：只有and操作符左边的操作数为True，且右边的操作符同时为True的时候，结果才为True
        or：操作符与and操作符不同，or操作符只需要左边或者右边任意一边为真，结果都为真；只有当两边同时为假，结果才为假
        not:not操作符是一个一元操作符，它的作用是得到一个和操作数相反
的布尔类型的值
"""
